Revit 2016 API
LoadCombination.CombinationState Property
Returns load combination state.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use LoadCombination.State property instead.")]
public string CombinationState { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use LoadCombination.State property instead.")> _
Public ReadOnly Property CombinationState As String
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use LoadCombination.State property instead.")]
public:
property String^ CombinationState {
	String^ get ();
}
Remarks
The state should be "Serviceability" or "Ultimate".
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace